<details><summary>Digger run report at 2024-03-04 17:25:17 (UTC)</summary>
    <details><summary>Plan for <b>diggerhq/demo-terragrunt-parallel#prod-svc-identity</b></summary>
  
```terraform
Terraform will perform the following actions:

  # module.iam_role.aws_iam_policy.example_policy must be replaced
-/+ resource "aws_iam_policy" "example_policy" {
      ~ arn         = "arn:aws:iam::891377204276:policy/s3_bucket_role_identity_prod-policy" -> (known after apply)
      ~ id          = "arn:aws:iam::891377204276:policy/s3_bucket_role_identity_prod-policy" -> (known after apply)
      ~ name        = "s3_bucket_role_identity_prod-policy" -> "s3_bucket_role_identity-policy" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPA47CRYXQ2B7SUGTRBO" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.iam_role.aws_iam_role.example_role must be replaced
-/+ resource "aws_iam_role" "example_role" {
      ~ arn                   = "arn:aws:iam::891377204276:role/s3_bucket_role_identity_prod" -> (known after apply)
      ~ create_date           = "2024-03-03T17:40:58Z" -> (known after apply)
      ~ id                    = "s3_bucket_role_identity_prod" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::891377204276:policy/s3_bucket_role_identity_prod-policy",
        ] -> (known after apply)
      ~ name                  = "s3_bucket_role_identity_prod" -> "s3_bucket_role_identity" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA47CRYXQ2ER3GHAXBU" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.iam_role.aws_iam_role_policy_attachment.example_attach must be replaced
-/+ resource "aws_iam_role_policy_attachment" "example_attach" {
      ~ id         = "s3_bucket_role_identity_prod-20240303174059471600000001" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::891377204276:policy/s3_bucket_role_identity_prod-policy" # forces replacement -> (known after apply) # forces replacement
      ~ role       = "s3_bucket_role_identity_prod" -> "s3_bucket_role_identity" # forces replacement
    }

  # module.s3_bucket.aws_s3_bucket.example_bucket must be replaced
-/+ resource "aws_s3_bucket" "example_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::demo-terragrunt-parallel-svc-identity-prod" -> (known after apply)
      ~ bucket                      = "demo-terragrunt-parallel-svc-identity-prod" -> "demo-terragrunt-parallel-svc-identity" # forces replacement
      ~ bucket_domain_name          = "demo-terragrunt-parallel-svc-identity-prod.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "demo-terragrunt-parallel-svc-identity-prod.s3.us-east-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "demo-terragrunt-parallel-svc-identity-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::891377204276:role/s3_bucket_role_identity_prod"
                        }
                      - Resource  = "arn:aws:s3:::demo-terragrunt-parallel-svc-identity-prod/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "48ca234ec08b854fd7875d07ed50011a403a0297310717063d53e2085019f22f" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.s3_bucket.aws_s3_bucket_policy.example_bucket_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "example_bucket_policy" {
      ~ bucket = "demo-terragrunt-parallel-svc-identity-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "demo-terragrunt-parallel-svc-identity-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = [
                              - "arn:aws:iam::891377204276:role/s3_bucket_role_identity_prod",
                            ]
                        }
                      - Resource  = "arn:aws:s3:::demo-terragrunt-parallel-svc-identity-prod/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

  ```
</details>

<details><summary>Terraform plan validation check (prod-svc-identity)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>

</details>